Routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("created_at", "updated_at", "artwork_id", "viewer_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-02-25 21:46:23.244370"], ["updated_at", "2019-02-25 21:46:23.244370"], ["artwork_id", 8], ["viewer_id", 11]]
---
    def create
        artwork_share = ArtworkShare.new(artwork_share_params)
        if artwork_share.save