Routes/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
---
    def index
        @artworks = Artwork.find_by(artist_id: params[:user_id])