Routes/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 8], ["LIMIT", 1]]
---
    def index
        # we find which comments based on if :id is artwork / user id ???!?!?!?!
        if params[:user_id]
            @comments = Comment.find_by(user_id: params[:user_id])
        elsif params[:artwork_id]
            @comments = Comment.find_by(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("created_at", "updated_at", "user_id", "artwork_id", "body") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-02-25 22:24:19.337787"], ["updated_at", "2019-02-25 22:24:19.337787"], ["user_id", 10], ["artwork_id", 8], ["body", "looks great!!!!!!!!"]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.save