Routes/app/controllers/users_controller.rb

    def show
      # find our user
      # render json
      user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]